{
      "0.1.0" : {
            "description" : "<ul><li>Initial release.</li></ul>",
            "requires" : "5.9.0",
            "tested" : "5.9.2",
            "upgrade_notice" : ""
      },
      "0.2.0" : {
            "description" : "<ul><li>Tweak - Readme changes.</li></ul>",
            "requires" : "5.9.0",
            "tested" : "5.9.2",
            "upgrade_notice" : ""
      },
      "0.2.1" : {
            "description" : "<ul><li>Tweak - Readme changes.</li></ul>",
            "requires" : "5.9.0",
            "tested" : "5.9.2",
            "upgrade_notice" : ""
      },
      "0.3.0" : {
            "description" : "<ul><li>Feature - Add support for the Post Purchase Upsell for WooCommerce plugin.</li><li>Tweak - Changed the ID of the order review in our checkout template.</li></ul>",
            "requires" : "5.9.0",
            "tested" : "5.9.2",
            "upgrade_notice" : ""
      },
      "0.3.1" : {
            "description" : "<ul><li>Fix - Fixed an issue with order management callbacks. The confirmation string was not being passed in the URL for the callback.</li></ul>",
            "requires" : "5.9.0",
            "tested" : "6.0.0",
            "upgrade_notice" : ""
      },
      "0.4.0": {
            "description": "<ul><li>Feature - Added support for OnHold callbacks from Qliro.</li><li>Tweak - Minor change to style to make the order review take up the space its allowed to take up</li><li>Fix - Fixed an issue with adminapi endpoints containing a extra backslash causing 404 errors.</li><li>Fix - Fixed sending a incorrect field name for MinimumCustomerAge.</li><li>Fix - Fixed some error handling on the order confirmation page.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.1.1",
            "upgrade_notice": ""
      },
      "0.5.0": {
            "description": "<ul><li>Feature - Added support for Table Rate Shipping plugin.</li><li>Fix - Fixed an issue caused by relying on the WooCommece cart hash if we should update an order to Qliro or not. This caused issues with anything that did not change the totals or the contents of the cart.</li><li>Fix - Fixed so the Qliro order id is logged with each request, making log parsing easier.</li><li>Enhancement - The Qliro HTML snippet is now stripped from the request logs.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.1.1",
            "upgrade_notice": ""
      }
}
