{
      "0.1.0": {
            "description": "<ul><li>Initial release.</li></ul>",
            "requires": "5.9.0",
            "tested": "5.9.2",
            "upgrade_notice": ""
      },
      "0.2.0": {
            "description": "<ul><li>Tweak - Readme changes.</li></ul>",
            "requires": "5.9.0",
            "tested": "5.9.2",
            "upgrade_notice": ""
      },
      "0.2.1": {
            "description": "<ul><li>Tweak - Readme changes.</li></ul>",
            "requires": "5.9.0",
            "tested": "5.9.2",
            "upgrade_notice": ""
      },
      "0.3.0": {
            "description": "<ul><li>Feature - Add support for the Post Purchase Upsell for WooCommerce plugin.</li><li>Tweak - Changed the ID of the order review in our checkout template.</li></ul>",
            "requires": "5.9.0",
            "tested": "5.9.2",
            "upgrade_notice": ""
      },
      "0.3.1": {
            "description": "<ul><li>Fix - Fixed an issue with order management callbacks. The confirmation string was not being passed in the URL for the callback.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.0.0",
            "upgrade_notice": ""
      },
      "0.4.0": {
            "description": "<ul><li>Feature - Added support for OnHold callbacks from Qliro.</li><li>Tweak - Minor change to style to make the order review take up the space its allowed to take up</li><li>Fix - Fixed an issue with adminapi endpoints containing a extra backslash causing 404 errors.</li><li>Fix - Fixed sending a incorrect field name for MinimumCustomerAge.</li><li>Fix - Fixed some error handling on the order confirmation page.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.1.1",
            "upgrade_notice": ""
      },
      "0.5.0": {
            "description": "<ul><li>Feature - Added support for Table Rate Shipping plugin.</li><li>Fix - Fixed an issue caused by relying on the WooCommece cart hash if we should update an order to Qliro or not. This caused issues with anything that did not change the totals or the contents of the cart.</li><li>Fix - Fixed so the Qliro order id is logged with each request, making log parsing easier.</li><li>Enhancement - The Qliro HTML snippet is now stripped from the request logs.</li><li>Enhancement - Add order note to WooCommerce orders when a Qliro order has been placed that contain the Qliro order id.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.1.1",
            "upgrade_notice": ""
      },
      "0.6.0": {
            "description": "<ul><li>Feature - You now have the ability to personalize the shipping section on the checkout page by using shipping labels. You can find these settings by navigating to WooCommerce → Shipping → Select a shipping method.</li><li>Feature - You now have the option to show a brief introductory text in the shipping section of the payment form on the checkout page.</li><li>Feature - You now have the convenience of placing a payment widget on the product page or any other location using the shortcode 'qliro_one_payment_widget'.</li><li>You are now able to place a banner widget on the shopping cart page or anywhere else using the shortcode 'qliro_one_banner_widget'.</li><li>Fix - We've resolved an issue where a JavaScript error would be triggered if a customer fails to identify themselves using the PNO after having used it for identification previously.</li><li>Tweak - We have reorganized the settings page of Qliro One to streamline navigation and improve user experience.</li><li>Enhancement - We have incorporated more detailed error messages to provide better clarity in case an order management action is unsuccessful.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "0.6.1": {
            "description": "<ul><li>Fix - Fixed an undefined index notice that happened due to missing a default value.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "0.6.2": {
            "description": "<ul><li>Fix - Updated our JavaScript to no longer use the deprecated getOrderUpdates function from Qliros JavaScript API, but rather use the onOrderUpdated function. Resolves issues with postcode based shipping.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "0.6.3": {
            "description": "<ul><li>Fix - Fixed issues with Table Rate shipping caused by settings introduced in 0.6.0. If you personalized the shipping section using the feature added in 0.6.0 you may need to reapply those settings.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "0.6.4": {
            "description": "<ul><li>Fix - Resolved an issue where the currency was incorrectly fetched from the store settings instead of the available order currency. This issue led to discrepancies when using a multi-currency plugin.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "1.0.0": {
            "description": "<ul><li>Feature - Adds support for sending pickup points to Qliro when displaying shipping methods in the Qliro One checkout. Needs to be supported by the individual shipping method.</li><li>Enhancement - Improved logging related to events during checkout process, when customer places the order.</li><li>Enhancement - Improved logging related to order management & callbacks.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.2.2",
            "upgrade_notice": ""
      },
      "1.0.1": {
            "description": "<ul><li>Tweak - Adds timer to allow max 4.5 seconds for order creation in Woo when customer completes purchase in Qliro One. If time limit exceeds, the purchase is denied. Avoids payments in Qliro where the order is missing in Woo.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.3.2",
            "upgrade_notice": ""
      },
      "1.1.0": {
            "description": "<ul><li>Feature - Adds support for delivery date (date start + date end) in shipping option displayed in checkout.</li><li>Tweak - Adds filter qliro_one_shipping_option so other plugins can hook into shipping option about to be sent to Qliro.</li><li>Tweak - Do not put the order to on-hold during callback handling if it already has been processed. Prevents possible issues where Trustly payments triggers two callbacks with different status simultaneously.</li><li>Fix - Fix undefined index warning.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.4.2",
            "upgrade_notice": ""
      },
      "1.1.1": {
            "description": "<ul><li>Enhancement - Adds a log message when a timeout occurs during the order creation process.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.4.3",
            "upgrade_notice": ""
      },
      "1.2.0": {
            "description": "<ul><li>Feature - The plugin now supports WooCommerce's \"High-Performance Order Storage\" (\"HPOS\") feature.</li><li>Tweak - Adjusted the timeout timer (4.5 → 29 seconds).</li><li>Fix - Resolved string interpolation deprecation warning.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.4.3",
            "upgrade_notice": ""
      },
      "1.3.0": {
            "description": "<ul><li>Feature - Support for integrated shipping with nShift using the Krokedil Shipping Connector plugin.</li><li>Enhancement - The shipping methods in WooCommerce will be hidden until Qliro has retrieved the selected shipping option from Qliro when showing shipping options in the Qliro iFrame.</li><li>Enhancement - Scoped the plugin dependencies for the plugin to avoid conflicts with other plugins using the same dependencies with different versions.</li><li>Fix - Fixed support for syncing the area returned by Qliro with the region field in WooCommerce.</li><li>Fix - Fixed an issue where some plugins used the same dependencies as Qliro but with different versions, causing a conflict and potential PHP errors.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.5.5",
            "upgrade_notice": ""
      },
      "1.3.1": {
            "description": "<ul><li>Fix - Sometimes the session ID would be missing, this would result in a critical error in the AJAX when attempting to retrieve the order from Qliro. This has now been fixed.</li><li>Fixed an issue due to undefined variable in the JavaScript.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.1",
            "upgrade_notice": ""
      },
      "1.4.0": {
            "description": "<ul><li>Feature - Added a metabox to Qliro order pages to show information about the Qliro order in WooCommerce.</li><li>Feature - Added a toggle to detach specific orders from the automatic order management. This is useful if you want to manually handle specific orders in WooCommerce.</li><li>Feature - Added a sync order with Qliro button that allows you to manually sync an order with Qliro if any changes have been made to it in WooCommerce. This is not available for card payments.</li><li>Fix - Fixed support for Finish localization by passing it correctly to Qliro's API.</li><li>Fix - Fixed not properly clearing the current session with Qliro when the currency is changed in the store.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.2",
            "upgrade_notice": ""
      },
      "1.5.0": {
            "description": "<ul><li>Feature - Added the ability to flag all products as high-risk through plugin settings or individually at the product level. Flagged products may disable certain payment methods.</li><li>Tweak - Enhanced compatibility with currency switchers by initializing a new session when the currency changes.</li><li>Tweak - Adjusted the styling of the 'Sync Order with Qliro' button.</li><li>Tweak - Enabled the plugin to handle zero-sum orders, with an option to override via the 'qliro_check_if_needs_payment' filter.</li><li>Fix - Resolved a critical error caused by the logger.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.2"
      },
      "1.5.1": {
            "description": "<ul><li>Fix - Fixed not handling Completed Qliro orders correctly if the customer landed back on the checkout page without the confirmation step being completed. The customer will now be redirected to a thankyou page for their order.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.2"
      },
      "1.6.0": {
            "description": "<ul><li>Feature - Added support for partial capture.</li><li>Feature - Added the 'qliro_one_enforced_juridical_type' filter for modifying the name of the cookie that refers to the customer type.</li><li>Tweak - Tweaked the metabox's design.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.2"
      },
      "1.7.0": {
            "description": "<ul><li>Feature - Added support for shipping with Ingrid.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.6.2"
      },
      "1.7.1": {
            "description": "<ul><li>Fix - Fixed an issue where an incorrect shipment reference was being used for Instabox integrated shipping in order management requests.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.0"
      },
      "1.7.2": {
            "description": "<ul><li>Enhancement - Improved the error handling when placing an order in WooCommerce when the session from Qliro has expired or is missing in WooCommerce, which would cause a timeout error.</li><li>Enhancement - When matching Ingrid shipping tax rates to WooCommerce, allow a diff of 0.1 when comparing the tax rates to avoid rounding discrepancies between the two systems. This will prevent the wrong tax rate from being used when calculating the shipping tax in WooCommerce.</li><li>Fix - Fixed an issue when refunding an order line without specifying the order line quantity causing a division by zero error.</li><li>Fix - Fixed an issue when refunding a shipment order line with the Ingrid integration, where metadata from the order line was not copied over to the refund order line.</li><li>Fix - Fixed trying to access a setting before it has been saved, causing a PHP warning.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.7.3": {
            "description": "<ul><li>Fix - Fixed an issue where we would print Qliro error messages on API calls to WooCommerce on Qliro orders in some cases, causing the response to not be a valid JSON output. This could cause issues when other services tried to for example set the order status on an order placed with Qliro.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.8.0": {
            "description": "<ul><li>Feature - Added support for gift cards.</li><li>Feature - Added support for subscriptions.</li><li>Feature - Added support for pay for order.</li><li>Added 'qoc_order_confirmed' to enable newsletter support, together with other custom actions when a Qliro order is confirmed.</li><li>Tweak - Allow order status 'Completed' if order is captured through portal.</li><li>Tweak - Added redirect to 'Thank you' page if order is already completed, but user is still on the checkout page.</li><li>Fix - Fixed PHP 8.3.0 array_sum warnings.</li><li>Fix - Fixed missing address data from Qliro API during update.</li><li>Fix - Fixed issue with unsetting other shipping methods.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.8.1": {
            "description": "<ul><li>Fix - Fixed an undefined array key warning.</li><li>Fix - Fixed a critical error that could occur while editing the checkout page.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.9.0": {
            "description": "<ul><li>Feature - Added 'Type' (discount, fee, shipping) to order lines.</li><li>Fix - Fixed an issue where free shipping coupons did not always update the order in checkout.</li><li>Fix - Fixed an issue where a removed coupon sometimes remained in the order.</li><li>Fix - Fixed an issue where refunds sometimes failed for pickup point orders.</li><li>Fix - Fixed 'MerchantReference' being incorrectly set for fees.</li><li>Fix - Fix so that negative fees are set as discounts.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.9.1": {
            "description": "<ul><li>Fix - Fixed a critical error that could occur when the merchant reference for fees was too long or included special characters.</li><li>Fix - Fixed an undefined array key warning.</li><li>Tweak - Improved logging by keeping track of user sessions with unique IDs.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.1"
      },
      "1.9.2": {
            "description": "<ul><li>Fix - Include cart hash when testing if we need to update a Qliro session or not to catch changes that effects products but not the order total.</li><li>Fix - Add a check when reading the Qliro order before submitting the WooCommerce order to ensure the Qliro order has not already been completed.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.2"
      },
      "1.10.0": {
            "description": "<ul><li>Feature - Added compatibility with the 'WooCommerce PostNord Shipping' plugin by Redlight Media.</li><li>Fix - Fixed country sometimes being set to null in checkout, when restricting selling locations.</li><li>Fix - Limited the max size of a log message from the frontend to 1000 characters to prevent large logs from being created.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.2"
      },
      "1.10.1": {
            "description": "<ul><li>Fix - Fixed an undefined array key warning.</li><li>Fix - Added 'Tax status' setting for shipping method to be compatible with WooCommerce 9.7+.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.7.2"
      },
      "1.11.0": {
            "description": "<ul><li>Feature - Added support for adding a return fee when making a refund on a Qliro order.</li><li>Feature - Added a setting to automatically calculate a return fee for Qliro orders, if a refund is made when the full amount of a order line is not refunded.</li><li>Feature - Added a setting to display a country selector on the checkout page or through the shortcode 'qliro_country_selector'.</li><li>Enhancement - Changed so the refund with Qliro button is not shown for orders that have not been completed with Qliro, preventing the refund from causing a API error when it can't be made.</li><li>Enhancement - Improved logging to handle situations where the remote requests returns WP_Error that is not properly logged.</li><li>Tweak - The sync order button will now always be available on the order edit page for all Qliro orders regardless of payment method.</li><li>Tweak - Checks if the order was paid with Qliro before showing the partial capture button on the order edit page.</li><li>Tweak - Removed pending, refunded and failed order statuses from part of the statuses in the order management where it is not relevant.</li><li>Tweak - Relabeling from \"Qliro One\" to \"Qliro\".</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.1"
      }, 
      "1.11.1": {
            "description": "<ul><li>Fix - Fixed a potential fatal error during checkout that could occur when the shipping option price was returned as a string that is not a valid number, caused by WooCommerce version 9.9.x.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.1"
      },
      "1.11.2": {
            "description": "<ul><li>Fix - Pay for order should now be working as expected.</li><li>Fix - Fixed a potential fatal error that could occur if dependencies failed to install properly.</li><li>Fix - Fixed the province data sometimes being incorrectly set on the order confirmation page.</li><li>Fix - Fixed a potential fatal error that could occur during order management actions when the shipping option price was returned as a string that is not a valid number, caused by WooCommerce version 9.9.x.</li><li>Enhancement - Added support for other plugins to set a description on shipping rates shown in the Qliro checkout. Supported by Krokedil Shipping Connector from version 3.16.0.</li><li>Tweak - Added the option to include a merchant integrity policy URL link in the Qliro iframe.</li><li>Tweak - Readme changes.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.1"
      },
      "1.12.0": {
            "description": "<ul><li>Feature - Redesigned the layout, structure and navigation of the settings page.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.1"
      },
      "1.13.0": {
            "description": "<ul><li>Feature - Added support for handling notification callbacks from Qliro after the order is placed. For now this only supports saving Ingrid shipping data when using the Qliro integrated shipping with Ingrid.</li><li>Feature - Added the action 'qliro_notification_{event_type}_{provider}' for custom handling of Qliro notification events. 'event_type' and 'provider' are the lowercase values sent by Qliro in the notification request.</li><li>Fix - Fixed an issue that could affect the Google Analytics tracking of the Qliro checkout.</li><li>Fix - Fixed the refund fee text not being removed when refund amount was zero.</li><li>Tweak - Renamed 'Order synchronization' to 'Order Management' in the Qliro order metabox.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.2"
      },
      "1.14.0": {
            "description": "<ul><li>Feature - Added support for sending VatRate on order lines to Qliro.</li><li>Fix - Resolved fatal error that could occur for merchants using PHP version 7.4 and below.</li><li>Fix - Updated some spelling and dead documentation links for the Qliro settings page.</li><li>Enhancement - Prepared the plugin for deployment to wordpress.org.</li><li>Tweak - Slightly updated the design of the checkout template.</li><li>Tweak - Renamed the Qliro metabox setting 'Order synchronization' to 'Order Management'.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.2"
      },
      "1.14.1": {
            "description": "<ul><li>Fix - Resolved the checkout page layout not working as expected for some layout options.</li></ul>",
            "requires": "5.9.0",
            "tested": "6.8.2"
      }

}
